# DisciplineTypeId Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DisciplineTypeId Properties
DisciplineTypeId Class See Also
---
The DisciplineTypeId type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Architecture | Architecture. |
| Common | Common. |
| Electrical | Electrical. |
| Energy | Energy. |
| Hvac | HVAC. |
| Infrastructure | Infrastructure. |
| Piping | Piping. |
| Structural | Structural. |

# See Also
DisciplineTypeId Class
Autodesk.Revit.DB Namespace